# -*- coding: utf-8 -*-
# 每一行一个任务，前面是任务名字，后面是任务的刷的次数
# 多个任务会按照顺序依次执行
TASKS = [
	# ('4-10', 6),
	# ('5-1', 32),
	#

	('SK-5', 5),
	('龙门外环', 3),
	('PR-B-2', 4),
	# ('CE-5', 15),
	# ('OF-5', 7),
	('OF-8', 8),
	# ('OF-5', 30),
	('OF-F4', 30),
	('OF-8', 2),
	('OF-F3', 10),
	# ('4-7', 4 * 3),
	# ('4-5', 9),
	# ('5-2', 15),
	# ('4-7', 12),
	# ('5-2', 24),
	# ('4-7', 12),
	# ('切尔诺伯格', 1),
	# ('龙门外环', 3),
	# ('龙门市区', 1),
	# ('PR-B-1', 6),
	# ('2-1', 30),
]


# 目前支持的任务参考, 
# 主线 0-5 章节
# 芯片任务
#	固若金汤 盾治疗芯片: PR-A-1, PR-A-2 ...
#	摧枯拉朽 射手,法师芯片: PR-B-1, PR-B-2 ...
#	势不可挡 先锋,辅助芯片: PR-C-1, PR-C-2 ...
#	身先士卒 近卫,特种芯片: PR-D-1, PR-D-2 ...
# 资源任务
#	战术演习 : LS-1
#	
#   等
# 副本任务
# 	切尔诺伯格
#	龙门外环
#	龙门市区
